IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_cm_wd_regs.xml
<module id="CM_WD_REGS" HW_revision="" description="CM WD Registers">
	<register id="SCSR" width="32" page="1" offset="0x0" internal="0" description="System Control and Status Register">
		<bitfield id="WDOVERRIDE" description="WD Override for WDDIS bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="WDENINT" description="WD Interrupt Enable" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="rsvd" description="Reserved" begin="15" end="3" width="13" rwaccess="R"/>
		<bitfield id="KEY" description="KEY field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="WDCNTR" width="32" page="1" offset="0x4" internal="0" description="Watchdog Counter Register">
		<bitfield id="WDCNTR" description="WD Counter" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="rsvd" description="Reserved" begin="31" end="8" width="24" rwaccess="R"/>
	</register>
	<register id="WDKEY" width="32" page="1" offset="0x8" internal="0" description="Watchdog Reset Key Register">
		<bitfield id="WDKEY" description="WD KEY" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="rsvd" description="Reserved" begin="31" end="8" width="24" rwaccess="R"/>
	</register>
	<register id="WDCR" width="32" page="1" offset="0xc" internal="0" description="Watchdog Control Register">
		<bitfield id="WDPS" description="WD Clock Prescalar" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="WDCHK" description="WD Check Bits" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="WDDIS" description="WD Disable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="WDFLG" description="WD Reset Status Flag" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="WDPRECLKDIV" description="WD Pre Clock Divider" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="rsvd" description="Reserved" begin="31" end="12" width="20" rwaccess="R"/>
	</register>
	<register id="WDWCR" width="32" page="1" offset="0x10" internal="0" description="Watchdog Windowed Control Register">
		<bitfield id="MIN" description="WD Min Threshold setting for Windowed Watchdog functionality" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="FIRSTKEY" description="First Key Detect Flag" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="rsvd" description="Reserved" begin="15" end="9" width="7" rwaccess="R"/>
		<bitfield id="KEY" description="KEY field" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
</module>
